blueprints/infosat/sap/request_xml/sap_invoices_customer_by_date.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global">
    <soapenv:Header />
    <soapenv:Body>
        <glob:Z_CustInvoiceQueryByElementsSimpleByRequest_sync>
            <Z_CustInvoiceSimpleSelectionBy>

                <SelectionByfacturaFecha>
                    <!--Optional:-->
                    <InclusionExclusionCode>I</InclusionExclusionCode>
                    <IntervalBoundaryTypeCode>3</IntervalBoundaryTypeCode>
                    <!--Optional:-->
                    <LowerBoundaryfacturaFecha>{{startDate}}</LowerBoundaryfacturaFecha>
                    <!--Optional:-->
                    <UpperBoundaryfacturaFecha>{{endDate}}</UpperBoundaryfacturaFecha>
                </SelectionByfacturaFecha>


            </Z_CustInvoiceSimpleSelectionBy>
            <ProcessingConditions>
                <!--Optional:-->
                <QueryHitsMaximumNumberValue>10000</QueryHitsMaximumNumberValue>
                <QueryHitsUnlimitedIndicator>false</QueryHitsUnlimitedIndicator>
                <!--Optional:-->
            </ProcessingConditions>
        </glob:Z_CustInvoiceQueryByElementsSimpleByRequest_sync>
    </soapenv:Body>
</soapenv:Envelope>